[
    {
        "dish": "Breakfast",
        "recipes": [
            {
                "name": "McDonald’s Breakfast Burrito",
                "image": "https://copykat.com/wp-content/uploads/2023/08/McDonalds-Breakfast-Burrito-Pin.jpg",
                "ingredients": [
                    "1 pound pork sausage mild",
                    "1/2 cup yellow onion diced",
                    "1/4 cup fresh tomatoes diced",
                    "1 tablespoon green chilies (diced those in a can)",
                    "10 – tortillas 6 inch torillas ",
                    "9 eggs",
                    "6 ounces American cheese 12 slices",
                    "1/2 cup salsa"
                ],
                "instructions": [
                    "1. Crumble and fry pork sausage, stir and separate meat so it will fry in small little pieces. Remove from heat drain excess grease. ",
                    "2. Place drained sausage in frying pan add onion, green chilies, and tomatoes, heat on medium temperature just until sausage and vegetables are heated through, stir frequently. ",
                    "3. Measure 2 cups of eggs and beat. Add the eggs to the pan with the sausage mixture. When cooked remove from heat. ",
                    "4. Place two tablespoons of the sausage and egg mixture onto 1 tortilla, tear each slice of American cheese into two even portions, then place the cheese on top of the sausage mixture, and roll the tortilla. ",
                    "5. If you make these all ahead of time, you can wrap in plastic to store them in the refrigerator or freezer, and then heat them up in the microwave for a moment or two.",
                    "6. Serve with your favorite taco or Picante sauce. You will find these are milder and really great for breakfast. I also like to serve sour cream and avocado with mine."
                ],
                "tags": [
                    "McDonald's",
                    "Breakfast"
                ]
            },
            {
                "name": "McDonald’s McGriddle",
                "image": "https://copykat.com/wp-content/uploads/2024/02/McDonalds-McGriddle-Photo.jpg",
                "ingredients": [
                    "1 ½ cups pancake mix",
                    "1 cup water",
                    "⅓ cup pancake syrup",
                    "4 sausage patties",
                    "4 slices American cheese",
                    "4 eggs",
                    "2 tablespoons olive oil",
                    "1 teaspoon salt",
                    "1 teaspoon pepper"
                ],
                "instructions": [
                    "1. Place pancake mix and water in a medium bowl. Mix until thoroughly combined.",
                    "2. Heat skillet over medium heat. Place a 3 inch metal round cookie cutter or mason jar lid lightly spray with non-stick spray in the skillet and fill it half full with pancake batter.",
                    "3. After one minute, when bubbles start to form, remove the cookie cutter and flip the pancake over. Cook on the other side for one minute then remove and put on a plate.",
                    "4. Repeat steps 2 & 3 until you have 8 pancakes for the sandwiches.",
                    "5. Using a silicone brush, spread syrup over both sides of the pancakes and set aside.",
                    "6. Cook the sausage patties over medium heat for 3 minutes on each side. Remove from heat and top them with cheese.",
                    "7. In a small bowl, beat egg with a fork (one at a time). Add a pinch of salt and pepper while beating.",
                    "8. Add a small amount of olive oil to the skillet. Add beaten egg and cook for about one minute, then fold the egg over twice to make a small square to fit the sandwich.",
                    "9. Repeat steps 7 & 8 for the remaining eggs.",
                    "10. Assemble sandwiches with pancake bottom, egg, sausage, cheese and topped with another pancake."
                ],
                "tags": [
                    "McDonald's",
                    "Breakfast"
                ]
            },
            {
                "name": "Kneaders Chunky Cinnamon French Toast & Caramel Syrup",
                "image": "https://www.sixsistersstuff.com/wp-content/uploads/2014/07/Kneaders-French-Toast-and-Caramel-Syrup.jpg-270x270.jpg",
                "ingredients": [
                    "French Toast:",
                    "1 loaf Kneaders Chunky Cinnamon Bread, cut into 8 slices (if you don't live near Kneaders, any type of thick-cut cinnamon swirl bread will work)",
                    "8 eggs",
                    "3 cups milk",
                    "1 Tablespoon brown sugar",
                    "¾ teaspoon salt",
                    "1 Tablespoon vanilla extract",
                    "2 Tablespoons butter",
                    "Caramel Syrup:",
                    "1 cup brown sugar",
                    "1 cup heavy whipping cream",
                    "1 cup corn syrup"
                ],
                "instructions": [
                    "1. Preheat an electric griddle to 375 degrees F.",
                    "2. In a shallow baking dish, mix eggs, milk, brown sugar, salt and vanilla",
                    "3. Melt butter evenly across your griddle.",
                    "4. Dip each slice of bread into egg mixture and coat completely on each side. ",
                    "5. Place coated bread on hot griddle and turn until lightly browned on each side. ",
                    "6. Optional: serve with whipped cream and strawberries on top."
                ],
                "tags": [
                    "Kneaders",
                    "Breakfast"
                ]
            },
            {
                "name": "Wildflower Bread Co. Fresh Lemon Ricotta Pancakes",
                "image": "https://abountifulkitchen.com/wp-content/uploads/2015/01/IMG_5989-1024x682.jpg",
                "ingredients": [
                    "2 eggs",
                    "1 cup ricotta, or about 200 grams",
                    "2 tablespoons sugar",
                    "2 tablespoons fresh lemon juice",
                    "1 tablespoon lemon zest",
                    "1/4 cup water, 1/4 additional may be needed to thin batter",
                    "3/4 cup all purpose flour",
                    "1 teaspoon baking soda",
                    "1/2 teaspoon baking powder",
                    "1/4 teaspoon salt"
                ],
                "instructions": [
                    "1. Heat griddle to medium high heat or 350 degrees. You may also wait to heat griddle until after the pancakes are mixed. I do this before mixing the batter because my griddle takes a while to fully heat.",
                    "2. In a large bowl, whisk the eggs. Add ricotta, sugar, lemon juice and lemon zest. Whisk together.",
                    "3. Add the water and whisk again.",
                    "4. Add the flour, baking soda, baking powder and salt all at once. Mix just until the wet and dry ingredients are incorporated. Do not over mix. The batter does not need to be smooth. Let sit for a couple of minutes.",
                    "5. Grease hot griddle with little butter or oil.",
                    "6. Check the batter, it should be similar to the consistency of a cake batter that can barely be poured.",
                    "7. Using a 1/4 cup measure, scoop out the pancake batter onto the griddle. Cook until the edges of the pancakes bubble and the bubbles pop. Flip the pancakes. Do not pat down. Do not flip more than once. The pancake is done when you quickly touch the middle of the pancake with a spatula, and the pancake springs back. If the batter is too thick, thin with a little water or milk.",
                    "8. Serve immediately with fresh blueberries and syrup."
                ],
                "tags": [
                    "Wildflower Bread Co.",
                    "Breakfast"
                ]
            }
        ]
    },
    {
        "dish": "Lunch",
        "recipes": [
            {
                "name": "Hard Rock Cafe California Style Cobb Salad",
                "image": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps185887_SD153208A08_13_10b-2.jpg?fit=500,500&webp=1",
                "ingredients": [
                    "1 bottle (18 ounces) barbecue sauce",
                    "2 tablespoons brown sugar",
                    "1/2 teaspoon garlic powder",
                    "1/4 teaspoon paprika",
                    "1-1/2 pounds boneless skinless chicken breasts",
                    "12 cups chopped romaine",
                    "2 avocados, peeled and chopped",
                    "3 plum tomatoes, chopped",
                    "2 small carrots, thinly sliced",
                    "1 medium sweet red or green pepper, chopped",
                    "3 hard-boiled large eggs, chopped",
                    "26 bacon strips, cooked and crumbled",
                    "1-1/2 cups shredded cheddar cheese",
                    "Salad dressing of your choice"
                ],
                "instructions": [
                    "1. In a greased 3-qt. slow cooker, mix barbecue sauce, brown sugar, garlic powder and paprika. Add chicken; turn to coat. Cook, covered, on low 3-4 hours or until chicken is tender (a thermometer should read at least 165°).",
                    "2. Remove chicken from slow cooker; cut into bite-sized pieces. In a bowl, toss chicken with 1 cup barbecue sauce mixture. Place romaine on a large serving platter; arrange chicken, avocado, vegetables, eggs, bacon and cheese over romaine. Drizzle with dressing."
                ],
                "tags": [
                    "Hard Rock Cafe",
                    "Lunch"
                ]
            },
            {
                "name": "Hard Rock Cafe Southwest Egg Rolls",
                "image": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_104189_THHC2377564B06_22_4bC_RMS.jpg?fit=500,500&webp=1",
                "ingredients": [
                    "1 cup fresh baby spinach, chopped",
                    "2 tablespoons finely chopped red onion",
                    "2 tablespoons finely chopped sweet red pepper",
                    "1 jalapeno pepper, seeded and minced",
                    "1 tablespoon canola oil",
                    "1/3 cup frozen corn, thawed",
                    "1/4 cup black beans, rinsed and drained",
                    "1/8 teaspoon salt",
                    "Dash cayenne pepper",
                    "Dash ground cumin",
                    "3/4 cup shredded reduced-fat Monterey Jack cheese or reduced-fat Mexican cheese blend",
                    "4 ounces reduced-fat cream cheese",
                    "30 wonton wrappers",
                    "Cooking spray"        
                ],
                "instructions": [
                    "1. In a large skillet, saute the spinach, onion, red pepper and jalapeno in oil until tender. Stir in the corn, beans and seasonings; heat through. Remove from the heat. Stir in shredded cheese and cream cheese until melted.",
                    "2. Position a wonton wrapper with one point toward you. (Keep remaining wrappers covered with a damp paper towel until ready to use.) Place 2 teaspoons of filling in the center of wrapper. Fold bottom corner over filling; fold sides toward center over filling. Roll toward the remaining point. Moisten top corner with water; press to seal. Repeat with remaining wrappers and filling.",
                    "3. Place in a 15x10x1-in. baking pan coated with cooking spray; lightly coat egg rolls with additional cooking spray. Bake at 425° for 8-10 minutes or until golden brown, turning once."
                ],
                "tags": [
                    "Hard Rock Cafe",
                    "Lunch",
                    "Side"
                ]
            },
            {
                "name": "L&L Hawaiian Macaroni Salad",
                "image": "https://www.chewoutloud.com/wp-content/uploads/2024/07/hawaiian-mac-vertical-1024x1536.jpg",
                "ingredients": [
                    "½ lb elbow macaroni",
                    "¼ cup onion, minced",
                    "2 TB shredded carrots",
                    "1 cup mayonnaise, real, whole mayo",
                    "¼ cup green onion, thinly sliced",
                    "½ tsp white pepper",
                    "1 tsp kosher salt",
                    "freshly chopped parsley , optional, for garnish"       
                ],
                "instructions": [
                    "1. Bring a large pot of well salted water to boil. Cook macaroni until tender, according to package instructions. Drain, rinse thoroughly with cold water; be sure to drain well.",
                    "2. Combine remaining ingredients with the cold, cooked macaroni. Toss to combine well. Chill 2-3 hours or overnight. Toss again right before serving."
                ],
                "tags": [
                    "L&L",
                    "Lunch",
                    "Side"
                ]
            },
            {
                "name": "Panda Express Honey Sesame Chicken",
                "image": "https://theheartylife.org/wp-content/uploads/2024/07/9-IMG_0599-1024x1536.jpg",
                "ingredients": [
                   "For the chicken:",
                    "1 1/2 – 2 lbs. Boneless, skinless chicken breasts, cut into 1\" pieces",
                    "1 Whole egg",
                    "Fresh cracked black pepper",
                    "1 tsp Kosher salt",
                    "1/2 cup Arrowroot powder or cornstarch",
                    "1/2 cup All-purpose flour or gluten free flour",
                    "Vegetable oil , for frying", 
                    "For the honey sauce:",
                    "1 tbsp Soy sauce or coconut aminos",
                    "2 tbsp Ketchup",
                    "2 tsp Rice wine vinegar",
                    "3 tbsp Honey or agave",
                    "1/4 cup Sweet chili sauce",
                    "2 tbsp Water",
                    "1 tsp Arrowroot powder or cornstarch",
                    "For the veggies:",
                    "2 tbsp Olive oil",
                    "1 lb. Fresh green beans, trimmed",
                    "1 Yellow bell pepper, sliced thin",
                    "Sesame seeds, for garnish",
                    "Green onions, for garnish"
                ],
                "instructions": [
                    "For the honey sauce:",
                    "1. In a bowl combine sweet chili sauce, honey, ketchup, water, soy sauce, rice wine vinegar, and cornstarch. Mix to combine.",
                    "For the chicken:",
                    "1. In a mixing bowl combine chicken and the egg, mix to coat evenly. Add flour, arrowroot powder, salt, and pepper to a shallow bowl, mix to combine. Dredge the chicken in the egg mixture followed by the flour mixture*, evenly coat each piece and set aside.",
                    "2. In a large Dutch oven or skillet heat about 2\" of vegetable oil over medium-high heat. Add the coated chicken to the hot oil, working in batches if needed*, cook for 3-4 minutes or until the chicken reaches and internal temperature of 165 degrees F. Remove from oil and transfer to a plate lined with paper towels to absorb any extra oil.",
                    "3. In a separate skillet heat olive oil over medium-high heat, once warm add in green beans and peppers. Sauté for 4-5 minutes or until vegetable start to soften. Pour in the honey sauce and let simmer with the vegetables for 2-3 minutes until the sauce begins to thicken.",
                    "4. Once the vegetables are tender and the sauce has thickened, add in the cooked chicken and mix to combine everything.",
                    "5. Serve immediately over rice and top with a sprinkle of sesame seeds and green onions."
                ],
                "tags": [
                    "Panda Express",
                    "Main Course",
                    "Dinner"
                ]
            },
            {
                "name": "Wildflower Bread Co. Potato Cream Cheese Soup",
                "image": "https://bakedinaz.com/wp-content/uploads/2016/08/Wildflower-Potato-Soup.jpg",
                "ingredients": [
                    "2 Tablespoons butter",
                    "½ cup chopped onions",
                    "¼ cup celery, finely diced",
                    "2 Tablespoons flour",
                    "3 cups shredded potatoes (I used a package of Simply Potatoes)",
                    "3 cups chicken broth",
                    "½ cup sour cream",
                    "4 ounces cream cheese",
                    "2 Tablespoons cooked and crumbled bacon or diced ham (I used real bacon crumbles)",
                    "salt & pepper",
                    "dried chives for garnish, optional"
                ],
                "instructions": [
                    "1. In a small saucepan melt the butter and sauté onions and celery until tender. Add the flour and stir, cooking over medium heat for 1 minute. Set aside.",
                    "2. In a large pan, combine the broth and potatoes. Bring to a boil and then reduce the heat to medium-low. Cook until potatoes are tender, but not mushy. Stir occasionally so they don't stick to the pan.",
                    "3. When the potatoes are tender, turn the heat to low and stir in the onion mixture, sour cream and cream cheese. Stir till creamy.",
                    "4. Add the bacon and salt and pepper to taste."
                ],
                "tags": [
                    "Wildflower Bread Co.",
                    "Lunch",
                    "Dinner"
                ]
            }
        ]
    },
    {
        "dish": "Dinner",
        "recipes": [
            {
                "name": "Chili’s Chile Mango Chicken with Rice",
                "image": "https://theheartylife.org/wp-content/uploads/2023/07/1-IMG_5441-1039x1536.webp",
                "ingredients": [
                   "For the Chicken:",
                    "3 tbsp Olive oil",
                    "3-4 Boneless skinless, chicken breast sliced thin into strips",
                    "2 tsp Chili powder",
                    "2 tsp Cumin",
                    "1 tsp Salt",
                    "Fresh cracked black pepper",
                    "2 cloves Garlic, minced",
                    "For the Mango Salsa:",
                    "2 large Mangos, diced",
                    "1 Jalapeno, finely diced",
                    "1 small Red onion, finely diced",
                    "4 Roma tomatoes, diced",
                    "Fresh cilantro, chopped",
                    "Steamed white rice",
                    "Sliced avocado",
                    "Green onion, for garnish"
                ],
                "instructions": [
                    "For the Chicken:",
                    "1. In a large bowl, combine the chicken, chili powder, cumin, salt, pepper, and garlic. Stir to evenly coat the chicken.",
                    "2. In a large Dutch oven or sauté pan, heat the oil over medium-high heat. Add in the seasoned chicken and sauté until cooked through, 8-10 minutes. Cook chicken in batches if needed.",
                    "For the Mango Salsa:",
                    "1. In a large mixing bowl combine mangos, jalapeno, red onion, tomatoes, and cilantro. Stir to combine, season as desired with salt and pepper.",
                    "2. To a serving bowl add steamed rice, top with the chili chicken, mango salsa, and sliced avocado. Garnish with green onions and extra chili powder if desired. Serve immediately or let cool and store in air tight containers in the fridge for up to 4 days."
                ],
                "tags": [
                    "Chili's",
                    "Main Course",
                    "Dinner"
                ]
            },
            {
                "name": "Cafe Rio Sweet Pork",
                "image": "https://www.favfamilyrecipes.com/wp-content/uploads/2021/07/Cafe-Rio-Sweet-Pork-6.jpg",
                "ingredients": [
                   "3 pound pork shoulder/butt roast",
                    "16 ounces Coca-Cola soda divided (*do not use diet soda. The sugar in regular soda is needed.)",
                    "1/4 cup water",
                    "1 teaspoon garlic salt",
                    "1/8 teaspoon salt",
                    "1/4 teaspoon pepper",
                    "1 can (4 ounces) diced green chilies",
                    "1 can (10 ounces) red enchilada sauce",
                    "3/4 cup packed brown sugar"
                ],
                "instructions": [
                    "1. Spray inside of a large crock pot with cooking spray. Place pork roast inside. Pour 8 ounces of Coca-Cola ( I used a measuring cup) and water around pork. (It does not need to cover roast) Sprinkle evenly with garlic salt, salt and pepper. Cover with lid and cook on high heat for 6 hours OR cook on low heat for 8 hours.",
                    "2. Remove pork from crock pot and transfer to cutting board. Discard liquid from crock pot. Shred pork with two forks, and remove any fat.",
                    "3. In a blender or food processor, blend the remaining 8 ounces Coca-Cola, diced green chilies, enchilada sauce and brown sugar. Blend until smooth.",
                    "4. Place shredded pork back in crock pot. Pour enchilada sauce mixture over the shredded pork. Cover crock pot with lid and cook another 1 to 2 hours on low heat. Serve pork in burritos, salads and tacos!"
                ],
                "tags": [
                    "Cafe Rio",
                    "Main Course",
                    "Dinner"
                ]
            },
            {
                "name": "Cheesecake Factory White Chicken Chili",
                "image": "https://theheartylife.org/wp-content/uploads/2023/11/46-IMG_7018-jpg-1070x1536.webp",
                "ingredients": [
                    "3 tbsp Olive oil",
                    "1 small Yellow onion, finely diced",
                    "3-4 cloves Garlic, minced",
                    "2 tsp Cumin",
                    "1 tsp Chili powder",
                    "1 tsp Kosher salt",
                    "Fresh cracked black pepper",
                    "1/2 tsp Paprika",
                    "1/4 cup Salsa Verde",
                    "2, 4 oz. Can, diced green chilis with juice",
                    "32 oz. Chicken stock, or vegetable broth",
                    "1 15 oz. can Cannellini beans, drained",
                    "1 8 oz. Boneless, skinless chicken breast",
                    "1 cup Heavy cream or whole milk",
                    "Avocado, cilantro, green onions, and cheese for garnish"
                ],
                "instructions": [
                    "1. In a large Dutch oven, heat olive oil over medium-high heat. Once warm, add in the diced onion. Sauté for 2-3 minutes until soft, add in minced garlic. Sauté for another 1-2 minutes until fragrant. Mix in dry seasonings and salsa Verde, stir to combine.",
                    "2. Keeping the heat on medium-high, add in the chilis, chicken, beans, and chicken stock, Stir to combine and cover. Simmer for 25-30 minutes, until chicken is cooked.",
                    "3. Once chicken is cooked, shred and return to the pot. Stir in heavy cream or milk, simmer on low for another 5 minutes. Serve garnished with avocado, cilantro, green onions, or cheese.",
                    "4. This chili will keep in an airtight container in the fridge for 3-4 days."
                ],
                "tags": [
                    "Cheesecake Factory",
                    "Dinner",
                    "Main Course",
                    "Soup"
                ]
            },
            {
                "name": "L&L Chicken Katsu Recipe",
                "image": "https://onohawaiianrecipes.com/wp-content/uploads/2022/06/chicken-katsu-2.jpg",
                "ingredients": [
                    "Chicken:",
                    "6-10 chicken thighs",
                    "seasoning",
                    "flour",
                    "whisked eggs",
                    "2 tsp milk (optional)",
                    "panko Japanese bread crumbs",
                    "2-3 cups oil",
                    "Katsu Sauce:",
                    "1/2 cup ketchup",
                    "2 tbsp shoyu (soy sauce)",
                    "1 tbsp mirin (white wine)",
                    "1 tbsp brown sugar",
                    "1 1/2 tsp worcestershire sauce",
                    "1/2 tsp ginger powder",
                    "1 clove minced garlic"     
                ],
                "instructions": [
                    "1. Heat an inch or two of oil in a pot over medium heat. Whisk together the eggs in a small bowl. Optional to add in milk to help stretch the egg. Add about 5 spoonful of flour to a plate and two handfuls of panko to a separate plate.",
                    "2. Tenderize or flatten the chicken with a mallet. Season both sides of the chicken with salt and pepper.",
                    "3. Dredge chicken thighs in flour, dip it in the whisked eggs, and lastly cover both sides in panko, lightly pressing down on each side.",
                    "4. Add the chicken to the oil and let it cook for 5 minutes each side or until it is golden brown.",
                    "5. Meanwhile add all the ingredients for the tonkatsu sauce to a small bowl and whisk it until all is mixed together well.",
                    "6. Serve the chicken katsu over hot rice along with the katsu sauce. Enjoy!"
                ],
                "tags": [
                    "L&L",
                    "Dinner"
                ]
            },
            {
                "name": "Olive Garden Zuppa Toscana Soup",
                "image": "https://www.lecremedelacrumb.com/wp-content/uploads/2019/03/easy-zuppa-toscano-soup-4.jpg",
                "ingredients": [
                    "1 pound spicy Italian ground sausage - use mild for kid-friendly",
                    "4 tablespoons butter",
                    "½ white onion - diced",
                    "1 tablespoon minced garlic",
                    "6 cups chicken broth",
                    "2 cups water",
                    "4-5 yellow potatoes - cut into 1-inch pieces",
                    "3 teaspoons salt - or to taste",
                    "1 teaspoon black pepper",
                    "2 cups heavy cream",
                    "4 cups chopped kale",
                    "chopped bacon or bacon bits and grated parmesan cheese for topping - optional"
                ],
                "instructions": [
                    "In a large pot saute sausage 5-6 minutes until browned. Use a slotted spoon to transfer sausage to a plate and set aside.",
                    "In the same pot, add butter and saute onions over medium heat until translucent. Add garlic and saute for another minute until fragrant.", 
                    "Add chicken broth, water, potatoes, salt, and pepper and bring to a boil. Boil until potatoes are tender. Stir in kale, and heavy cream. Add sausage. Taste and add salt and pepper if needed. Serve garnished with grated parmesan cheese and/or bacon if desired."
                ],
                "tags": [
                    "Olive Garden",
                    "Main Course",
                    "Dinner"
                ]
            },
            {
                "name": "Panda Express Honey Sesame Chicken",
                "image": "https://theheartylife.org/wp-content/uploads/2024/07/9-IMG_0599-1024x1536.jpg",
                "ingredients": [
                   "For the chicken:",
                    "1 1/2 – 2 lbs. Boneless, skinless chicken breasts, cut into 1\" pieces",
                    "1 Whole egg",
                    "Fresh cracked black pepper",
                    "1 tsp Kosher salt",
                    "1/2 cup Arrowroot powder or cornstarch",
                    "1/2 cup All-purpose flour or gluten free flour",
                    "Vegetable oil , for frying", 
                    "For the honey sauce:",
                    "1 tbsp Soy sauce or coconut aminos",
                    "2 tbsp Ketchup",
                    "2 tsp Rice wine vinegar",
                    "3 tbsp Honey or agave",
                    "1/4 cup Sweet chili sauce",
                    "2 tbsp Water",
                    "1 tsp Arrowroot powder or cornstarch",
                    "For the veggies:",
                    "2 tbsp Olive oil",
                    "1 lb. Fresh green beans, trimmed",
                    "1 Yellow bell pepper, sliced thin",
                    "Sesame seeds, for garnish",
                    "Green onions, for garnish"
                ],
                "instructions": [
                    "For the honey sauce:",
                    "1. In a bowl combine sweet chili sauce, honey, ketchup, water, soy sauce, rice wine vinegar, and cornstarch. Mix to combine.",
                    "For the chicken:",
                    "1. In a mixing bowl combine chicken and the egg, mix to coat evenly. Add flour, arrowroot powder, salt, and pepper to a shallow bowl, mix to combine. Dredge the chicken in the egg mixture followed by the flour mixture*, evenly coat each piece and set aside.",
                    "2. In a large Dutch oven or skillet heat about 2\" of vegetable oil over medium-high heat. Add the coated chicken to the hot oil, working in batches if needed*, cook for 3-4 minutes or until the chicken reaches and internal temperature of 165 degrees F. Remove from oil and transfer to a plate lined with paper towels to absorb any extra oil.",
                    "3. In a separate skillet heat olive oil over medium-high heat, once warm add in green beans and peppers. Sauté for 4-5 minutes or until vegetable start to soften. Pour in the honey sauce and let simmer with the vegetables for 2-3 minutes until the sauce begins to thicken.",
                    "4. Once the vegetables are tender and the sauce has thickened, add in the cooked chicken and mix to combine everything.",
                    "5. Serve immediately over rice and top with a sprinkle of sesame seeds and green onions."
                ],
                "tags": [
                    "Panda Express",
                    "Main Course",
                    "Dinner"
                ]
            },
            {
                "name": "Wildflower Bread Co. Potato Cream Cheese Soup",
                "image": "https://bakedinaz.com/wp-content/uploads/2016/08/Wildflower-Potato-Soup.jpg",
                "ingredients": [
                    "2 Tablespoons butter",
                    "½ cup chopped onions",
                    "¼ cup celery, finely diced",
                    "2 Tablespoons flour",
                    "3 cups shredded potatoes (I used a package of Simply Potatoes)",
                    "3 cups chicken broth",
                    "½ cup sour cream",
                    "4 ounces cream cheese",
                    "2 Tablespoons cooked and crumbled bacon or diced ham (I used real bacon crumbles)",
                    "salt & pepper",
                    "dried chives for garnish, optional"
                ],
                "instructions": [
                    "1. In a small saucepan melt the butter and sauté onions and celery until tender. Add the flour and stir, cooking over medium heat for 1 minute. Set aside.",
                    "2. In a large pan, combine the broth and potatoes. Bring to a boil and then reduce the heat to medium-low. Cook until potatoes are tender, but not mushy. Stir occasionally so they don't stick to the pan.",
                    "3. When the potatoes are tender, turn the heat to low and stir in the onion mixture, sour cream and cream cheese. Stir till creamy.",
                    "4. Add the bacon and salt and pepper to taste."
                ],
                "tags": [
                    "Wildflower Bread Co.",
                    "Lunch",
                    "Dinner"
                ]
            }
        ]
    }, 
    {
        "dish": "Dessert",
        "recipes": [
            {
                "name": "Applebee's Blondie",
                "image": "https://www.the-girl-who-ate-everything.com/wp-content/uploads/2024/01/maple-blondie-02.jpg",
                "ingredients": [
                    "Blondie:",
                    "3/4 cup unsalted butter, melted",
                    "1 ½ cups brown sugar",
                    "1 large egg plus 1 egg yolk",
                    "2 teaspoons vanilla extract",
                    "1½ cups all-purpose flour",
                    "1/2 teaspoon baking powder",
                    "1/2 teaspoon baking soda",
                    "1/2 teaspoon salt",
                    "1/2 cup chopped pecans or walnuts",
                    "1/2 cup white chocolate chips",
                    "Maple Cream Sauce:",
                    "1/4 cup butter, softened",
                    "1/4 cup powdered sugar",
                    "2 tablespoons cream cheese, softened",
                    "1 tablespoon maple syrup",
                    "vanilla ice cream for serving"     
                ],
                "instructions": [
                    "1. Preheat oven to 350℉ and grease an 8x8 baking dish.",
                    "2. In a large bowl, beat the butter and sugar together until combined. Add the eggs and vanilla; beat until light in color. ",
                    "3. Whisk in the flour, baking powder, baking soda, and salt. Stir in the white chocolate chips and nuts. ",
                    "4. Spread into the prepared baking dish. Bake for 25-35 minutes or until the center is set. For a gooey center cook around 25 minutes. The bars will set up as they cool. Cook longer for firmer bars.",
                    "5. While blondies are cooking, make the Maple Cream Sauce. In a small bowl, whisk together the butter, powdered sugar, cream cheese, and syrup by hand or with a mixer. If you want it thinner you can heat it for a few seconds in the microwave. ",
                    "6. Serve blondies warm with a scoop of vanilla ice cream, drizzled with the maple cream sauce."
                ],
                "tags": [
                    "Applebee's",
                    "Dessert"
                ]
            },
            {
                "name": "Cheesecake Factory Godiva Chocolate Cheesecake",
                "image": "https://allshecooks.com/wp-content/uploads/2024/09/cheesecake-factory-godiva-chocolate-cheesecake-23-1024x1536.jpg",
                "ingredients": [
                   "For the crust/brownie bottom:",
                    "4 oz. godiva dark chocolate",
                    "½ cup butter",
                    "¾ cup sugar",
                    "3 large eggs",
                    "½ cup cocoa powder",
                    "1 teaspoon vanilla extract",
                    "For the cheesecake:",
                    "12 oz. dark godiva chocolate",
                    "3 8 oz. bricks cream cheese softened",
                    "1 cup granulated sugar",
                    "5 large eggs room temperature",
                    "1 teaspoon vanilla extract",
                    "¼ cup cocoa powder",
                    "½ cup sour cream",
                    "For the mousse:",
                    "4 oz. godiva dark chocolate",
                    "1 tablespoon butter",
                    "3 large eggs separated",
                    "¼ teaspoon cream of tartar",
                    "¼ cup sugar",
                    "⅓ cup heavy cream",
                    "1 teaspoon vanilla extract"
                ],
                "instructions": [
                    "For the crust/brownie bottom:",
                    "1. Preheat the oven to 350 F. Grease a 9” springform pan and set aside.",
                    "2. In a medium microwave safe bowl, melt together the chocolate and butter in 30 second increments, stirring after each, until smooth.",
                    "3. Stir in the sugar, followed by the eggs, one at a time. Mix in the vanilla.",
                    "4. Stir in the cocoa powder until fully combined, then transfer to the prepared pan.",
                    "5. Bake in the preheated oven for 10-15 minutes, or until the brownie has formed a crust.",
                    "6. Allow to cool.",
                    "For the cheesecake:",
                    "1. Melt the chocolate in 30 second intervals in the microwave, stirring after each, until the chocolate is melted and smooth; set aside to cool",
                    "2. In a large bowl, cream together the cream cheese and sugar until smooth. Add the eggs and vanilla, one at a time, scraping down the bowl and mixing well in between each addition.",
                    "3. Add the sour cream and stir to combine. Add the cocoa powder and mix well. Mix in the melted chocolate and stir until the batter is a uniform brown color.",
                    "4. Pour the batter into the pan with the brownie crust, then return to the oven and bake for 50 - 65 minutes, or until the edges are set and the center wobbles slightly.",
                    "5. Allow to cool for 1 hour in the oven with the door open, then remove from the oven and allow to cool completely. Transfer to the fridge to chill for at least 6 hours or overnight.",
                    "For the mousse:",
                    "1. In a medium pan over low heat, melt the chocolate and butter until smooth, allow to cool slightly, then add the egg yolks and whisk until smooth.",
                    "2. In a separate bowl, whip the egg whites until foamy, then add the cream of tartar and whip until stiff peaks form. Fold into the melted chocolate mixture.",
                    "3. In a separate bowl, whip the heavy cream and granulated sugar until stiff peaks form.",
                    "4. Gently fold into the chocolate mixture. Stir in the vanilla.",
                    "5. Spread the mousse evenly over top of the cheesecake with the sides still on the pan. Allow to chill for at least 2 hours to set.",
                    "6. Remove the sides of the pan and garnish each slice with whipped cream and a piece of godiva dark chocolate."
                ],
                "tags": [
                    "Cheesecake Factory",
                    "Dessert"
                ]
            },
            {
                "name": "Shake Shake Toasted Marshmallow & Malt Milkshake",
                "image": "https://www.fifteenspatulas.com/wp-content/uploads/2012/04/Toasted-Marshmallow-Malt-Milkshake-Fifteen-Spatulas-1-640x960.jpg",
                "ingredients": [
                   "1/2 cup mini marshmallows",
                    "2-4 tbsp milk",
                    "2 tbsp malted milk powder",
                    "2 tbsp marshmallow creme",
                    "2 cups vanilla ice cream"
                ],
                "instructions": [
                    "1. Place the mini marshmallows on a sheet pan and stick under the broiler until lightly golden brown and toasted. This goes quickly, in a matter of about 30 seconds, so watch them carefully.",
                    "2. Place 2 tbsp milk, the malted milk powder, and the marshmallow creme in a blender. Blend for 30 seconds until everything has dissolved and mixed together.",
                    "3. Add the ice cream and half the marshmallows, and blend until mixed. Serve with the remaining toasted marshmallows on top."
                ],
                "tags": [
                    "Shake Shake",
                    "Dessert",
                    "Drink"
                ]
            },
            {
                "name": "Starbucks Peppermint Hot Chocolate",
                "image": "https://theheartylife.org/wp-content/uploads/2023/10/IMG_6831-jpg-1024x1536.webp",
                "ingredients": [
                   "2 1/2 cups Whole milk",
                    "1/4 cup Granulated sugar",
                    "2 tbsp Unsweetened cocoa powder",
                    "6 oz. Semi-sweet chocolate chips",
                    "1 tsp Vanilla extract",
                    "1/2 tsp Peppermint extract",
                    "Marshmallows, candy canes, or whipped cream for topping "
                ],
                "instructions": [
                    "1. In a large saucepan combine milk, sugar, and cocoa. Heat over medium-high heat for 3-4 minutes, stirring often until sugar is dissolved.",
                    "2. Once sugar is dissolved, add in chocolate, vanilla extract, and peppermint extract. Heat again over medium-high heat until chocolate is melted and the mixture is smooth.",
                    "3. Serve immediately topped with marshmallows, whipped cream, and candy canes!"
                ],
                "tags": [
                    "Starbucks",
                    "Drink"
                ]
            },
            {
                "name": "Starbucks Oat Bars",
                "image": "https://feelgoodfoodie.net/wp-content/uploads/2021/09/starbucks-oat-bars-11-1024x1536.jpg",
                "ingredients": [
                    "3 ¾ cups quick oats",
                    "1 teaspoon salt",
                    "½ cup unsalted butter",
                    "½ cup packed light brown sugar packed",
                    "¼ cup maple syrup",
                    "¼ cup unsweetened almond milk",
                    "1 teaspoon vanilla extract"
                ],
                "instructions": [
                    "1. Preheat oven to 325°F and line an 8x8 inch pan with parchment paper.",
                    "2. In the bowl of a food processor, grind 2 cups of oats until super fine and flour-like. Add to a large bowl and stir in the remaining 1¾ cups oats and salt. Mix to combine.",
                    "3. Melt the butter, brown sugar, and maple over medium heat in a small saucepan until the butter is completely melted and the sugar is dissolved. Remove from heat and whisk in the almond milk and vanilla extract. Let cool slightly.",
                    "4. Pour the butter mixture into the oat mixture and stir with a wooden spoon until combined. Spoon the mixture into the prepared pan and press the oats into the pan evenly.",
                    "5. Bake until slightly golden brown, rotating halfway through, 20 minutes. Let cool and then slice into bars."
                ],
                "tags": [
                    "Starbucks",
                    "Side",
                    "Breakfast"
                ]
            }
        ]
    },
    {
        "dish": "Drink",
        "recipes": [
            {
                "name": "Red Robin Freckled Lemonade",
                "image": "https://copykat.com/wp-content/uploads/2009/10/copycat-recipe-red-robin-freckled-lemonade.jpg",
                "ingredients": [
                    "2 tablespoons frozen strawberries with syrup thawed",
                    "1 1/2 cups lemonade (Minute Maid recommended)",
                    "ice",
                    "fresh strawberries for garnish if desired"
                ],
                "instructions": [
                    "1. Place two tablespoons of the strawberries and syrup into the bottom of a tall highball glass.  Add lemonade and stir the mixture together. Fill the glass with ice. Garnish with fresh strawberries if desired.",
                    "2. Or you can use a shaker if you have one on hand. Pour the lemonade and frozen strawberries and syrup into the shaker then shake and pour over ice. Garnish with fresh strawberries if desired."
                ],
                "tags": [
                    "Red Robin",
                    "Drink"
                ]
            },
            {
                "name": "Starbucks Cinnamon Dolce Syrup",
                "image": "https://theheartylife.org/wp-content/uploads/2022/09/20-IMG_1650-scaled-370x555.jpg",
                "ingredients": [
                   "1/2 cup Granulated Sugar",
                    "1/2 cup Light brown sugar, packed",
                    "1 cup Water",
                    "2-3 Cinnamon sticks, or ground cinnamon",
                    "1 tbsp Vanilla extract"
                ],
                "instructions": [
                    "1. In a medium saucepan combine the sugars, water, cinnamon sticks, and vanilla extract. Heat over medium-high heat until simmering, simmer for 3-5 minutes or until the sugar is dissolved.",
                    "2. Reduce heat to medium-low and allow to reduce for 10-12 minutes. The mixture should be fragrant and thickened slightly. Allow to cool and transfer to an airtight container. Store in the fridge for up to a month."
                ],
                "tags": [
                    "Starbucks",
                    "Drink"
                ]
            },
            {
                "name": "Starbucks Peppermint Hot Chocolate",
                "image": "https://theheartylife.org/wp-content/uploads/2023/10/IMG_6831-jpg-1024x1536.webp",
                "ingredients": [
                   "2 1/2 cups Whole milk",
                    "1/4 cup Granulated sugar",
                    "2 tbsp Unsweetened cocoa powder",
                    "6 oz. Semi-sweet chocolate chips",
                    "1 tsp Vanilla extract",
                    "1/2 tsp Peppermint extract",
                    "Marshmallows, candy canes, or whipped cream for topping "
                ],
                "instructions": [
                    "1. In a large saucepan combine milk, sugar, and cocoa. Heat over medium-high heat for 3-4 minutes, stirring often until sugar is dissolved.",
                    "2. Once sugar is dissolved, add in chocolate, vanilla extract, and peppermint extract. Heat again over medium-high heat until chocolate is melted and the mixture is smooth.",
                    "3. Serve immediately topped with marshmallows, whipped cream, and candy canes!"
                ],
                "tags": [
                    "Starbucks",
                    "Drink"
                ]
            }
        ]
    },
    {
        "dish": "Side",
        "recipes": [
            {
                "name": "Hard Rock Cafe Southwest Egg Rolls",
                "image": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_104189_THHC2377564B06_22_4bC_RMS.jpg?fit=500,500&webp=1",
                "ingredients": [
                    "1 cup fresh baby spinach, chopped",
                    "2 tablespoons finely chopped red onion",
                    "2 tablespoons finely chopped sweet red pepper",
                    "1 jalapeno pepper, seeded and minced",
                    "1 tablespoon canola oil",
                    "1/3 cup frozen corn, thawed",
                    "1/4 cup black beans, rinsed and drained",
                    "1/8 teaspoon salt",
                    "Dash cayenne pepper",
                    "Dash ground cumin",
                    "3/4 cup shredded reduced-fat Monterey Jack cheese or reduced-fat Mexican cheese blend",
                    "4 ounces reduced-fat cream cheese",
                    "30 wonton wrappers",
                    "Cooking spray"        
                ],
                "instructions": [
                    "1. In a large skillet, saute the spinach, onion, red pepper and jalapeno in oil until tender. Stir in the corn, beans and seasonings; heat through. Remove from the heat. Stir in shredded cheese and cream cheese until melted.",
                    "2. Position a wonton wrapper with one point toward you. (Keep remaining wrappers covered with a damp paper towel until ready to use.) Place 2 teaspoons of filling in the center of wrapper. Fold bottom corner over filling; fold sides toward center over filling. Roll toward the remaining point. Moisten top corner with water; press to seal. Repeat with remaining wrappers and filling.",
                    "3. Place in a 15x10x1-in. baking pan coated with cooking spray; lightly coat egg rolls with additional cooking spray. Bake at 425° for 8-10 minutes or until golden brown, turning once."
                ],
                "tags": [
                    "Hard Rock Cafe",
                    "Lunch",
                    "Side"
                ]
            },
            {
                "name": "L&L Hawaiian Macaroni Salad",
                "image": "https://www.chewoutloud.com/wp-content/uploads/2024/07/hawaiian-mac-vertical-1024x1536.jpg",
                "ingredients": [
                    "½ lb elbow macaroni",
                    "¼ cup onion, minced",
                    "2 TB shredded carrots",
                    "1 cup mayonnaise, real, whole mayo",
                    "¼ cup green onion, thinly sliced",
                    "½ tsp white pepper",
                    "1 tsp kosher salt",
                    "freshly chopped parsley , optional, for garnish"       
                ],
                "instructions": [
                    "1. Bring a large pot of well salted water to boil. Cook macaroni until tender, according to package instructions. Drain, rinse thoroughly with cold water; be sure to drain well.",
                    "2. Combine remaining ingredients with the cold, cooked macaroni. Toss to combine well. Chill 2-3 hours or overnight. Toss again right before serving."
                ],
                "tags": [
                    "L&L",
                    "Lunch",
                    "Side"
                ]
            },
            {
                "name": "Red Robin Campfire Sauce",
                "image": "https://copykat.com/wp-content/uploads/2018/12/Red-Robin-Campfire-Sauce-copycat-recipe.jpg",
                "ingredients": [
                   "1/2 cup mayonnaise",
                    "1/2 cup inexpensive hickory smoked barbecue sauce",
                    "1 tablespoon Tabasco Chipotle Sauce",
                    "1/2 teaspoon ground chipotle chili pepper",
                    "3 or 4 drops Worcestershire sauce"
                ],
                "instructions": [
                    "1. Combine all ingredients together in a small bowl and stir well.",
                    "2. The sauce is better if you allow it to rest 1 hour before serving."
                ],
                "tags": [
                    "Red Robin",
                    "Side"
                ]
            },
            {
                "name": "Starbucks Oat Bars",
                "image": "https://feelgoodfoodie.net/wp-content/uploads/2021/09/starbucks-oat-bars-11-1024x1536.jpg",
                "ingredients": [
                    "3 ¾ cups quick oats",
                    "1 teaspoon salt",
                    "½ cup unsalted butter",
                    "½ cup packed light brown sugar packed",
                    "¼ cup maple syrup",
                    "¼ cup unsweetened almond milk",
                    "1 teaspoon vanilla extract"
                ],
                "instructions": [
                    "1. Preheat oven to 325°F and line an 8x8 inch pan with parchment paper.",
                    "2. In the bowl of a food processor, grind 2 cups of oats until super fine and flour-like. Add to a large bowl and stir in the remaining 1¾ cups oats and salt. Mix to combine.",
                    "3. Melt the butter, brown sugar, and maple over medium heat in a small saucepan until the butter is completely melted and the sugar is dissolved. Remove from heat and whisk in the almond milk and vanilla extract. Let cool slightly.",
                    "4. Pour the butter mixture into the oat mixture and stir with a wooden spoon until combined. Spoon the mixture into the prepared pan and press the oats into the pan evenly.",
                    "5. Bake until slightly golden brown, rotating halfway through, 20 minutes. Let cool and then slice into bars."
                ],
                "tags": [
                    "Starbucks",
                    "Side",
                    "Breakfast"
                ]
            },
            {
                "name": "Taco Bell Quesadilla Sauce",
                "image": "https://keytomylime.com/wp-content/uploads/2019/08/Copycat-Taco-Bell-Quesadilla-Sauce-Pin-4.jpg",
                "ingredients": [
                    "½ cup mayonnaise",
                    "½ cup sour cream ",
                    "3 Tablespoons pickled jalapeno juice (from a jar of pickled jalapenos)",
                    "3 Tablespoons pickled jalapenos (diced)",
                    "2 teaspoon paprika ",
                    "2 teaspoons ground cumin ",
                    "1 teaspoon garlic granules ",
                    "1 teaspoon onion powder",
                    "½ teaspoon salt (or to taste)",
                    "½ teaspoon chili powder "  
                ],
                "instructions": [
                    "1. In a medium bowl, mix all ingredients together."
                ],
                "tags": [
                    "Taco Bell",
                    "Side"
                ]
            }
        ]
    }
]